# Read the three files into python as dataframes

In [151]:
import pandas as pd
import numpy as np


df1=pd.read_csv(r'C:\Users\Benutzer1\Ironhack\Week_1\Day_2\Morning\lab-customer-analysis-round-1\files_for_lab\csv_files\file1.csv')
df2=pd.read_csv(r'C:\Users\Benutzer1\Ironhack\Week_1\Day_2\Morning\lab-customer-analysis-round-1\files_for_lab\csv_files\file2.csv')
df3=pd.read_csv(r'C:\Users\Benutzer1\Ironhack\Week_1\Day_2\Morning\lab-customer-analysis-round-1\files_for_lab\csv_files\file3.csv')
#df1=pd.read_csv('../files_for_lab/csv_files/file1.csv')
#df2=pd.read_csv('../files_for_lab/csv_files/file2.csv')
#df3=pd.read_csv('../files_for_lab/csv_files/file3.ccsv')

# Show the DataFrame's shape.

In [152]:
print(df1.shape,df2.shape,df3.shape)

(4008, 11) (996, 11) (7070, 11)

# Standardize header names.

In [153]:
df1.columns.unique()

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [154]:
df11=df1.copy()
cols = []
for column in df11.columns:
    cols.append(column.lower())
df11.columns = cols
df11 = df11.rename(columns={'st':'state'})

In [155]:
df11.columns.unique()

Index(['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [156]:
def standerlize(x):
    if ( ' ' in x ):
        x = x.replace(" ","_")
    return x
df11.columns = df11.columns.to_series().apply(standerlize)
df11.columns.unique()

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [157]:
df22=df2.copy()
cols = []
for column in df22.columns:
    cols.append(column.lower())
df22.columns = cols
df22 = df22.rename(columns={'st':'state'})
df22.columns = df22.columns.to_series().apply(standerlize)
df22.columns.unique()

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [158]:
df33=df3.copy()
cols = []
for column in df33.columns:
    cols.append(column.lower())
df33.columns = cols

df33.columns = df33.columns.to_series().apply(standerlize)
df33.columns.unique()

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [159]:
df33.head()

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

# Rearrange the columns in the dataframe as needed

In [160]:
df11=df11[['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class']]
df22=df22[['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class']]
df33=df33[['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class']]

In [161]:
df11.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,1131.464935,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,566.472247,Personal Auto,Two-Door Car
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,529.881344,Corporate Auto,SUV
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,17.269323,Personal Auto,Four-Door Car

In [162]:
df22.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [163]:
df33.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,499.200000,Personal Auto,Two-Door Car
1,TB86706,Arizona,M,Master,2502.637401,0,66,0,3.468912,Personal Auto,Two-Door Car
2,ZL73902,Nevada,F,Bachelor,3265.156348,25820,82,0,393.600000,Personal Auto,Four-Door Car
3,KX23516,California,F,High School or Below,4455.843406,0,121,0,699.615192,Personal Auto,SUV
4,FN77294,California,M,High School or Below,7704.958480,30366,101,2,484.800000,Personal Auto,SUV

# Concatenate the three dataframes

In [164]:
data=pd.concat([df11,df22,df33], axis=0,ignore_index=True)

In [165]:
print(df11.shape,df22.shape,df33.shape,data.shape)

(4008, 11) (996, 11) (7070, 11) (12074, 11)

# Which columns are numerical?

In [166]:
data.select_dtypes(np.number)

        income  monthly_premium_auto  total_claim_amount
0          0.0                1000.0            2.704934
1          0.0                  94.0         1131.464935
2      48767.0                 108.0          566.472247
3          0.0                 106.0          529.881344
4      36357.0                  68.0           17.269323
...        ...                   ...                 ...
12069  71941.0                  73.0          198.234764
12070  21604.0                  79.0          379.200000
12071      0.0                  85.0          790.784983
12072  21941.0                  96.0          691.200000
12073      0.0                  77.0          369.600000

[12074 rows x 3 columns]

In [167]:
#Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount are numerical

# Which columns are categorical?

In [168]:
data.select_dtypes(np.object)

,customer,state,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,1/0/00,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,697953.59%,1/0/00,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1288743.17%,1/0/00,Personal Auto,Two-Door Car
3,WW63253,California,M,Bachelor,764586.18%,1/0/00,Corporate Auto,SUV
4,GA49547,Washington,M,High School or Below,536307.65%,1/0/00,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,Bachelor,23406,0,Personal Auto,Four-Door Car
12070,PK87824,California,F,College,3096.51,0,Corporate Auto,Four-Door Car
12071,TD14365,California,M,Bachelor,8163.89,3,Corporate Auto,Four-Door Car
12072,UP19263,California,M,College,7524.44,0,Personal Auto,Four-Door Car
12073,Y167826,California,M,College,2611.84,0,Corporate Auto,Two-Door Car

In [169]:
#customers,state,gender,education,policy type,Veheicle class are categorical

# Understand the meaning of all columns

# Perform the data cleaning operations mentioned so far in class

Delete the column education and the number of open complaints from the dataframe.

In [170]:
data = data.drop(['education','number_of_open_complaints'], axis=1)

In [171]:
data.columns.unique()

Index(['customer', 'state', 'gender', 'customer_lifetime_value', 'income',
       'monthly_premium_auto', 'total_claim_amount', 'policy_type',
       'vehicle_class'],
      dtype='object')

Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [172]:
data2=data.copy()

data2['customer_lifetime_value'].value_counts(dropna=False)

NaN                  2944
41787.90343             6
8879.790017             6
5169.49937              6
4270.034393999999       6
                     ...
2837.109178             1
5677.642084             1
1074703.09%             1
321860.86%              1
7229.329256999999       1
Name: customer_lifetime_value, Length: 8212, dtype: int64

In [173]:
def clean_median2(x): #remove the values that contains '%'
    if (isinstance(x,float)):
        return x
    elif (isinstance(x,int)):
        return float(x)
    else:
        temp = ""
        for index, value in enumerate(x):
            if (value.isdigit()== True or (value in [".","-"])):
                temp += value
        x = float(temp)
        return x
    
data2['customer_lifetime_value'] = list(map(clean_median2,data2['customer_lifetime_value']))
data2[['customer_lifetime_value']]
#data2['Customer Lifetime Value'] = data2['Customer Lifetime Value'].apply(clean_string)   
#data2['Customer Lifetime Value'] = list(map(clean_median,data2['Customer Lifetime Value']))

       customer_lifetime_value
0                          NaN
1                 6.979536e+05
2                 1.288743e+06
3                 7.645862e+05
4                 5.363077e+05
...                        ...
12069             2.340599e+04
12070             3.096511e+03
12071             8.163890e+03
12072             7.524442e+03
12073             2.611837e+03

[12074 rows x 1 columns]

In [174]:
data2['customer_lifetime_value'].value_counts(dropna=False)

NaN              2944
5096.673223         6
5246.278375         6
2719.506996         6
2659.705650         6
                 ...
501175.160000       1
2869.997625         1
11196.460020        1
2563.394054         1
292497.670000       1
Name: customer_lifetime_value, Length: 8212, dtype: int64

In [175]:
data2['customer_lifetime_value'] =  pd.to_numeric(data2['customer_lifetime_value'], errors='coerce')#change into numerical type

In [176]:
data2['customer_lifetime_value'].value_counts(dropna=False)

NaN              2944
5096.673223         6
5246.278375         6
2719.506996         6
2659.705650         6
                 ...
501175.160000       1
2869.997625         1
11196.460020        1
2563.394054         1
292497.670000       1
Name: customer_lifetime_value, Length: 8212, dtype: int64

In [177]:
data2['customer_lifetime_value']=data2['customer_lifetime_value'].round(2)
#data2['Customer Lifetime Value'].apply(lambda x: x*100)

In [178]:
data2['customer_lifetime_value'].value_counts(dropna=False)

NaN           2944
4605.04          6
9031.21          6
3265.16          6
5568.95          6
              ...
525473.43        1
1434985.99       1
19190.32         1
8237.38          1
3981.78          1
Name: customer_lifetime_value, Length: 8188, dtype: int64

In [179]:
data2.info()
data2
#data2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 9137 non-null   object
 1   state                    9137 non-null   object
 2   gender                   9015 non-null   object
 3   customer_lifetime_value  9130 non-null   float64
 4   income                   9137 non-null   float64
 5   monthly_premium_auto     9137 non-null   float64
 6   total_claim_amount       9137 non-null   float64
 7   policy_type              9137 non-null   object
 8   vehicle_class            9137 non-null   object
dtypes: float64(4), object(5)
memory usage: 849.1+ KB

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,policy_type,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,697953.59,0.0,94.0,1131.464935,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,1288743.17,48767.0,108.0,566.472247,Personal Auto,Two-Door Car
3,WW63253,California,M,764586.18,0.0,106.0,529.881344,Corporate Auto,SUV
4,GA49547,Washington,M,536307.65,36357.0,68.0,17.269323,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,23405.99,71941.0,73.0,198.234764,Personal Auto,Four-Door Car
12070,PK87824,California,F,3096.51,21604.0,79.0,379.200000,Corporate Auto,Four-Door Car
12071,TD14365,California,M,8163.89,0.0,85.0,790.784983,Corporate Auto,Four-Door Car
12072,UP19263,California,M,7524.44,21941.0,96.0,691.200000,Personal Auto,Four-Door Car
12073,Y167826,California,M,2611.84,0.0,77.0,369.600000,Corporate Auto,Two-Door Car

Check for duplicate rows in the data and remove if any.

In [180]:
print(data2.shape)

(12074, 9)

In [181]:
data2 = data2.drop_duplicates(subset=['customer_lifetime_value'])

In [182]:
print(data2.shape) #there are less row now,so duplicates get droped

(8188, 9)

In [183]:
data2['customer_lifetime_value'].value_counts(dropna=False)

343613.43     1
2370611.34    1
7532.26       1
2548.84       1
32069.88      1
             ..
4200.82       1
2993.02       1
6141.96       1
3210.14       1
NaN           1
Name: customer_lifetime_value, Length: 8188, dtype: int64

Filter out the data for customers who have an income of 0 or less.

In [184]:
data2[data2['income']<=0].shape

(2151, 9)

In [185]:
data2[data2['income']<=0]

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount,policy_type,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,2.704934,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,697953.59,0.0,94.0,1131.464935,Personal Auto,Four-Door Car
3,WW63253,California,M,764586.18,0.0,106.0,529.881344,Corporate Auto,SUV
7,CF85061,Arizona,M,721610.03,0.0,101.0,363.029680,Corporate Auto,Four-Door Car
10,SX51350,California,M,473899.20,0.0,67.0,482.400000,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...,...
12061,BB10681,California,F,4140.65,0.0,123.0,590.400000,Corporate Auto,SUV
12065,RX91025,California,M,19872.26,0.0,185.0,1950.725547,Personal Auto,SUV
12066,AC13887,California,M,4629.00,0.0,67.0,482.400000,Corporate Auto,Two-Door Car
12071,TD14365,California,M,8163.89,0.0,85.0,790.784983,Corporate Auto,Four-Door Car
12073,Y167826,California,M,2611.84,0.0,77.0,369.600000,Corporate Auto,Two-Door Car

In [186]:
data2=data2.drop(data2[data2['income']<=0].index)# delete the rows which income is 0 or less than 0

In [187]:
data2[data2['income']<=0]

Empty DataFrame
Columns: [customer, state, gender, customer_lifetime_value, income, monthly_premium_auto, total_claim_amount, policy_type, vehicle_class]
Index: []